[View in Colaboratory](https://colab.research.google.com/github/afarane/kaggle/blob/master/kaggle_titanic.ipynb)

## Titanic Dataset Exploration by @afarane

[ https://www.kaggle.com/c/titanic/data ]

In [0]:
import pandas as pd
import numpy as np

# visualization
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline

In [2]:
# 1. Load train & test Dataset 
train_data = pd.read_csv("train.csv")
test_data = pd.read_csv("test.csv")

# Profile Report on Dataset 
#pfr = pandas_profiling.ProfileReport(train_data)
#report.to_file("DS_Titanic_AF.html")

print('train data: %s, test data %s' %(str(train_data.shape), str(test_data.shape)) )
train_data.head()
print('_'*40)

train data: (891, 12), test data (418, 11)
________________________________________

In [3]:
train_data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
#### 1. Unique Values:
#PasengerID : Yes
#Name :  No
#---------------------------------------------------
# Check If PassengerId is Unique 
if (train_data.PassengerId.nunique() == train_data.shape[0]):
    print('PassengerId is Unique.') 
else:
    print('-[Error]Id is not Unique.')    
    
if (len(np.intersect1d(train_data.PassengerId.values, test_data.PassengerId.values))== 0 ):
    print('train and test datasets are Distinct.')
else:
    print('- [Error] train and test datasets are NOT Distinct.')

PassengerId is Unique.
train and test datasets are Distinct.

In [5]:
train_data.shape

(891, 12)

In [6]:
train_data.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

### Which columns I do not need ?

'Ticket'-> NA

'Cabin' --> ?

'Embarked'--> NA

In [0]:
y = train_data.pop('Survived')

In [8]:
numeric_variables = list(train_data.dtypes[train_data.dtypes !='object'].index)
numeric_variables

['PassengerId', 'Pclass', 'Age', 'SibSp', 'Parch', 'Fare']

In [9]:
train_data[numeric_variables].head()

   PassengerId  Pclass   Age  SibSp  Parch     Fare
0            1       3  22.0      1      0   7.2500
1            2       1  38.0      1      0  71.2833
2            3       3  26.0      0      0   7.9250
3            4       1  35.0      1      0  53.1000
4            5       3  35.0      0      0   8.0500

In [10]:
train_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 11 columns):
PassengerId    891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(4), object(5)
memory usage: 76.6+ KB

In [11]:
# Check for missing data & list them 
nas = pd.concat([train_data.isnull().sum(), test_data.isnull().sum()], axis=1, keys=['Train Dataset', 'Test Dataset']) 
print('Nan in the data sets')
print(nas[nas.sum(axis=1) > 0])

Nan in the data sets
          Train Dataset  Test Dataset
Age                 177            86
Fare                  0             1
Cabin               687           327
Embarked              2             0

In [0]:
# ---------------- Cabin ----------------
# Drop the This not relevent 
train_data.drop(['Cabin','Ticket'], axis=1, inplace=True)
test_data.drop(['Cabin','Ticket'], axis=1, inplace=True)

In [0]:
# ---------------- Age ----------------
train_data['Age'].fillna(train_data['Age'].mean(),inplace=True)
 # convert from float to int
train_data['Age'] = train_data['Age'].astype(int)
test_data['Age'].fillna(test_data['Age'].mean(),inplace=True)
 # convert from float to int
test_data['Age'] = test_data['Age'].astype(int)

In [0]:
# ---------------- Embarked ----------------
#replacing the missing values in the Embarked feature with S
train_data = train_data.fillna({"Embarked": train_data['Embarked'].mode()[0]})


# TestData doesn't contain Missing Values for Embarked

In [0]:
# ---------------- Fare ----------------
# Fill NaN
train_data['Fare'].fillna(train_data['Fare'].mean(),inplace=True)
 # convert from float to int
train_data['Fare'] = train_data['Fare'].astype(int)

# Fill NaN
test_data['Fare'].fillna(test_data['Fare'].mean(),inplace=True)
 # convert from float to int
test_data['Fare'] = test_data['Fare'].astype(int)

In [23]:
# Check for missing data & list them 
nas = pd.concat([train_data.isnull().sum(), test_data.isnull().sum()], axis=1, keys=['Train Data', 'Test Data']) 
print('NaN in the data sets')
print(nas[nas.sum(axis=1) > 0])

Nan in the data sets
Empty DataFrame
Columns: [Train Data, Test Data]
Index: []

In [22]:
train_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 9 columns):
PassengerId    891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            891 non-null int64
SibSp          891 non-null int64
Parch          891 non-null int64
Fare           891 non-null int64
Embarked       891 non-null object
dtypes: int64(6), object(3)
memory usage: 62.7+ KB